In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sea
import numpy as np

In [5]:
url = 'res/uber.xlsx'
xls = pd.ExcelFile(url)
df1 = pd.read_excel(xls, 'Copyright')
df2 = pd.read_excel(xls, 'Data Dictionary')
df3 = pd.read_excel(xls, 'Switchbacks')

display(df1.head())
display(df2.head())
display(df3.head())

,Innovation at Uber: The Launch of Express POOL,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,Harvard Business School Case 619-003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Courseware: 619-702,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"REV: August 6, 2020",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,This courseware was prepared solely as the ba...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

,Data Dictionary,Unnamed: 1,Unnamed: 2
0,"""Switchbacks"" Tab",NaN,NaN
1,Variable,Type,Definition
2,city_id,String,Location where the experiment took place. In t...
3,period_start,Date,Start date and time for the 160-minute time pe...
4,wait_time,String,"This variable takes on two possible values: ""2..."

,city_id,period_start,wait_time,treat,commute,trips_pool,trips_express,rider_cancellations,total_driver_payout,total_matches,total_double_matches
0,Boston,2018-02-19 07:00:00,2 mins,False,True,1415,3245,256,34458.411634,3372,1476
1,Boston,2018-02-19 09:40:00,5 mins,True,False,1461,2363,203,29764.349821,2288,1275
2,Boston,2018-02-19 12:20:00,2 mins,False,False,1362,2184,118,27437.367363,2283,962
3,Boston,2018-02-19 15:00:00,5 mins,True,True,1984,3584,355,44995.452993,4035,2021
4,Boston,2018-02-19 17:40:00,2 mins,False,False,1371,2580,181,27583.955295,2200,979

## Questions

### 1. What is the effect of extending the waiting time from 2  to 5 min on the total of completed trips / proportion of trips correclty matched / driver's earnings?

### 2. From a quantitative point of view, what would you recommend to Stock? Should he increase the waiting time in the 6 cities? Â¿When does the increment should be applied?

### 3. Evaluate the Express project: what was done right by Uber? What could have improved?